Revit 2026 API

# BaseArrayLabel Property

---

The family parameter label of the BaseArray.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FamilyParameter Label { get; set; }
```
```vb
Public Property Label As FamilyParameter
	Get
	Set
```
```cpp
public:
property FamilyParameter^ Label {
	FamilyParameter^ get ();
	void set (FamilyParameter^ value);
}
```
```fsharp
member Label : FamilyParameter with get, set
```

#### Property Value

FamilyParameter

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when the family parameter's ParameterType is not ParameterType.Integer. |
| InvalidOperationException | Thrown when trying to label the BaseArray out of family document. |

The label associates the number of members of the array with a family parameter. A BaseArray only can be labeled in a family document and only can be labeled to a integer FamilyParameter. To unbind the family parameter, set this property to .

#### Reference

BaseArray Class

Autodesk.Revit.DB Namespace